{
    "episodes": [
        {
            "id": 373423,
            "thetvdb_id": 4812524,
            "youtube_id": null,
            "title": "City of Heroes",
            "season": 1,
            "episode": 1,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E01",
            "global": 1,
            "description": "Barry Allen a tout juste 11 ans lorsque sa mère meurt dans de mystérieuses circonstances. Son père,  reconnu comme étant responsable de cette tragédie, est envoyé derrière les barreaux. Le gamin est alors élevé par le détective Joe West, le père de sa meilleure amie, Iris. Désormais adulte, le jeune homme n'abandonne pas l'espoir de découvrir la vérité sur la mort étrange de celle qui lui a donné la vie. Pour l'heure, devenu un brillant expert de la police scientifique de Central City, il aide à reccueillir les preuves qui permettront de coincer les criminels. En véritable geek, sa dernière obsession est un accélérateur de particules activé par l'équipe de S.T.A.R. Labs. Dirigée par un physicien visionnaire du nom d'Harrison Wells, la société entend faire une avancée historique qui aura d'incroyables répercussion sur la science et la médecine. Malheureusement, une anomalie provoque une explosion qui déclenche une terrible tempête. De nombreuses vies sont perdues cette nuit-là, et Barry perd connaissance après avoir été frappé par la foudre alors qu'il se trouvait dans son laboratoire. Après 9 mois de coma, il se réveille sans se douter que son existence va prendre un nouveau virage. L'accident semble l'avoir doté d'étonnants pouvoirs...",
            "date": "2014-10-07",
            "note": {
                "total": "2142",
                "mean": "4.3002",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "94",
            "subtitles": []
        },
        {
            "id": 391417,
            "thetvdb_id": 4929322,
            "youtube_id": null,
            "title": "Fastest Man Alive",
            "season": 1,
            "episode": 2,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E02",
            "global": 2,
            "description": "Barry est toujours en train d’explorer ses nouvelles capacités, et se rend compte que sa vitesse lui donne de fréquents vertiges. L’équipe de S.T.A.R. Labs et la police découvre également un nouveau métahumain en liberté.",
            "date": "2014-10-14",
            "note": {
                "total": "2020",
                "mean": "4.2421",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "68",
            "subtitles": []
        },
        {
            "id": 391418,
            "thetvdb_id": 4929325,
            "youtube_id": null,
            "title": "Things You Can't Outrun",
            "season": 1,
            "episode": 3,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E03",
            "global": 3,
            "description": "Un des métahumains commet une série d’attaques en empoisonnant ses victimes. Barry et son équipe se mettent en chasse. Joe est bien décidé à faire la lumière sur le meurtre de la mère de Barry.",
            "date": "2014-10-21",
            "note": {
                "total": "1928",
                "mean": "4.2220",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "45",
            "subtitles": []
        },
        {
            "id": 395211,
            "thetvdb_id": 4936770,
            "youtube_id": null,
            "title": "Going Rogue",
            "season": 1,
            "episode": 4,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E04",
            "global": 4,
            "description": "Felicity Smoak est de passage à Central City pour rendre visite à Barry, qu’elle n’a pas vu depuis son accident. Ce dernier voit l’arrivée d’un nouvel adversaire qui a trouvé une faille au Flash.",
            "date": "2014-10-28",
            "note": {
                "total": "1935",
                "mean": "4.3664",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "67",
            "subtitles": []
        },
        {
            "id": 415127,
            "thetvdb_id": 5025023,
            "youtube_id": null,
            "title": "Plastique",
            "season": 1,
            "episode": 5,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E05",
            "global": 5,
            "description": "Barry et son équipe découvrent une nouvelle personne métamorphosée par l’explosion du labo. Il s’agit d’une militaire qui transforme ce qu’elle touche en bombe. Barry, mais aussi l’armée, tente alors de lui mettre la main dessus.",
            "date": "2014-11-11",
            "note": {
                "total": "1830",
                "mean": "4.2536",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "46",
            "subtitles": []
        },
        {
            "id": 415483,
            "thetvdb_id": 5028737,
            "youtube_id": null,
            "title": "The Flash Is Born",
            "season": 1,
            "episode": 6,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E06",
            "global": 6,
            "description": "Malgré ses tentatives pour éloigner Iris de « La traînée rouge », Barry n’arrive pas à convaincre la jeune journaliste que sa sécurité est en jeu. Mais une ancienne connaissance refait surface et pourrait changer cela.",
            "date": "2014-11-18",
            "note": {
                "total": "1771",
                "mean": "4.3179",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "43",
            "subtitles": []
        },
        {
            "id": 415484,
            "thetvdb_id": 5028738,
            "youtube_id": null,
            "title": "Power Outage",
            "season": 1,
            "episode": 7,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E07",
            "global": 7,
            "description": "En croisant le chemin d’un méta humain capable d’absorber l’électricité, Barry perd ses pouvoirs. C’est alors la course pour les récupérer, et tenter d’aller sauver le commissariat de Central City d’une prise d’otage.",
            "date": "2014-11-25",
            "note": {
                "total": "1745",
                "mean": "4.3009",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "30",
            "subtitles": []
        },
        {
            "id": 415485,
            "thetvdb_id": 5028739,
            "youtube_id": null,
            "title": "Flash vs. Arrow (1)",
            "season": 1,
            "episode": 8,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E08",
            "global": 8,
            "description": "Barry is thrilled when Oliver, Felicity and Diggle come to Central City to investigate a case involving a deadly boomerang.",
            "date": "2014-12-02",
            "note": {
                "total": "1936",
                "mean": "4.5057",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "62",
            "subtitles": []
        },
        {
            "id": 421423,
            "thetvdb_id": 5042818,
            "youtube_id": null,
            "title": "The Man in the Yellow Suit",
            "season": 1,
            "episode": 9,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E09",
            "global": 9,
            "description": "Alors que Barry et tous ses proches s’apprêtent à fêter Noël, le Flash jaune est de retour à Central City pour dérober un appareil scientifique. Caitlin rencontre de son côté une ancienne connaissance.",
            "date": "2014-12-09",
            "note": {
                "total": "2124",
                "mean": "4.5014",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "88",
            "subtitles": []
        },
        {
            "id": 423880,
            "thetvdb_id": 5052260,
            "youtube_id": null,
            "title": "Revenge of the Rogues",
            "season": 1,
            "episode": 10,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E10",
            "global": 10,
            "description": "Leonard Snart alias Captain Cold fait son grand retour à Central City ! Mais cette fois, il est accompagné de Mick Rory alias Heat Wave. Après avoir volé une peinture valant un demi-million de dollars, le duo de criminels décide de tendre un piège à The Flash. Les méchants kidnappent une personne chère à Barry et menacent le héros d’assassiner la victime, à moins que The Flash n’aille à leur rencontre pour une bataille mêlant feu et glace. Barry dit à Joe qu’il ne trouve pas judicieux de s’attaquer à Snart vu les dommages qui ont été causés lors de leur dernière rencontre. Le justicier demande ensuite au Dr Wells, Caitlin et Cisco de l’aider à travailler plus dur pour rivaliser contre Reverse Flash. Iris essaie de gérer au mieux la confession que Barry lui a faite et Cisco crée un nouveau bouclier pour le service de police de Central City .",
            "date": "2015-01-20",
            "note": {
                "total": "1998",
                "mean": "4.2077",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "42",
            "subtitles": []
        },
        {
            "id": 429046,
            "thetvdb_id": 5073549,
            "youtube_id": null,
            "title": "The Sound and the Fury",
            "season": 1,
            "episode": 11,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E11",
            "global": 11,
            "description": "L'ancien protégé de Dr Wells, Hartley Rathaway est de retour pour se venger de son mentor après avoir été touché par l'explosion de l'accélérateur de particules. Désormais capable de manipuler les ondes sonores, Rathaway est une dangereuse menace pour Wells et The Flash. Pendant ce temps, Iris est heureuse d'avoir été engagée en tant que jeune reporter au journal de Central City. Malheureusement, son supérieur la place avec un vétéran, qui ne veut pas d'elle. Cisco se rappelle son premier jour à STAR Labs et sa rencontre avec Hartley et Caitlin. Joe demande une faveur à Eddie, et de ne pas en parler à Barry.",
            "date": "2015-01-27",
            "note": {
                "total": "1905",
                "mean": "4.1921",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "37",
            "subtitles": []
        },
        {
            "id": 429047,
            "thetvdb_id": 5073556,
            "youtube_id": null,
            "title": "Crazy for You",
            "season": 1,
            "episode": 12,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E12",
            "global": 12,
            "description": "Caitlin décide qu'il est temps pour Barry et elle de tourner les pages \"Ronnie\" et \"Iris\" de façon définitive. Pour ce faire, elle organise une soirée dans un bar-karaoké de la ville. Malheureusement, Caitlin ne trouve pas son bonheur. Cependant, Barry rencontre Linda Parks, une journaliste sportive qui travaille pour le Central City Picture News. Conquis par la jeune femme, Barry lui propose un rendez-vous. A cette annonce, Iris réagit étrangement.\nPendant ce temps, Cisco prend en considération l'offre dangereuse que lui propose Hartley tandis que l'équipe est à la recherche de Shauna. Cette meta-humaine a le pouvoir de se téléporter à sa guise et décide de piéger son petit-ami Clay dans Iron Heights.\nQuand le père de Barry se met à chercher des indices pour aider Joe et son fils à résoudre une affaire, il atterrit à l'infirmerie après avoir été passé à tabac par des criminels.",
            "date": "2015-02-03",
            "note": {
                "total": "1884",
                "mean": "4.3137",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "58",
            "subtitles": []
        },
        {
            "id": 435481,
            "thetvdb_id": 5088525,
            "youtube_id": null,
            "title": "The Nuclear Man",
            "season": 1,
            "episode": 13,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E13",
            "global": 13,
            "description": "Après que Ronnie ait attaqué un physicien, Barry et l’équipe réalisent qu’ils doivent se lancer à la poursuite du fiancé de Caitlin qui est maintenant un dangereux méta-humain. Ils déduisent que la meilleure manière de traquer Ronnie consiste à trouver le Dr Martin Stein qui travaillait sur un projet nommé F.I.R.E.S.T.O.R.M. Barry a du mal à trouver un équilibre entre ses responsabilités en tant que Flash et sa relation avec Linda Park. Joe fait appel à Cisco afin de rouvrir l’enquête sur le meurtre de Nora Allen. Le général Eiling revient à Central City.",
            "date": "2015-02-10",
            "note": {
                "total": "1906",
                "mean": "4.3416",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "30",
            "subtitles": []
        },
        {
            "id": 439841,
            "thetvdb_id": 5104336,
            "youtube_id": null,
            "title": "Fallout",
            "season": 1,
            "episode": 14,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E14",
            "global": 14,
            "description": "Bien que Ronnie and Dr. Stein aient été séparés par l'explosion nucléaire, Barry et l'équipe pensent que les deux hommes sont sains et saufs. Caitlin est enchantée du retour de son fiancé et se prépare à reprendre leur vie à deux tandis que Stein retourne vers son épouse. Mais lorsque le Général Eiling s'attaque à Firestorm, Ronnie et Stein doivent déterminer s'ils sont plus en sécurité ensemble ou séparément. Entretemps, Mason Bridge explique à Iris qu'il se trame quelque chose à STAR Labs. Le Dr. Stein donne à Barry des renseignements importants sur le voyage dans le temps.",
            "date": "2015-02-17",
            "note": {
                "total": "2066",
                "mean": "4.3974",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "80",
            "subtitles": []
        },
        {
            "id": 439842,
            "thetvdb_id": 5104337,
            "youtube_id": null,
            "title": "Out of Time",
            "season": 1,
            "episode": 15,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E15",
            "global": 15,
            "description": "Mark Mardon, le frère du premier ennemi du Flash, revient à Central City pour se venger du détective West. Cisco décide de vérifier les théories de Joe pour découvrir les secrets du docteur Wells.",
            "date": "2015-03-17",
            "note": {
                "total": "1962",
                "mean": "4.6386",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "100",
            "subtitles": []
        },
        {
            "id": 439843,
            "thetvdb_id": 5104338,
            "youtube_id": null,
            "title": "Rogue Time",
            "season": 1,
            "episode": 16,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E16",
            "global": 16,
            "description": "En découvrant sa capacité à remonter le temps, Barry va empêcher un tsunami de se produire. Mais le docteur Wells l’avertit que changer la tournure des événements provoque d’autres dangers. Barry s’en rend rapidement compte avec le retour de Snart et de sa clique.",
            "date": "2015-03-24",
            "note": {
                "total": "1849",
                "mean": "4.2677",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "49",
            "subtitles": []
        },
        {
            "id": 439844,
            "thetvdb_id": 5104339,
            "youtube_id": null,
            "title": "Tricksters",
            "season": 1,
            "episode": 17,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E17",
            "global": 17,
            "description": "Un imitateur qui se fait appeler Trickster s'est mis à poser des bombes dans Central City. Pour l'arrêter, Barry et Joe rendent visite au vrai Trickster, un brillant criminel du nom de Jesse James emprisonné voilà 20 ans. La situation tourne rapidement au vinaigre quand les deux Tricksters s'unissent et s'emparent d'Henry. Parallèlement, Iris demande à Eddie de l'aider à résoudre une affaire, et des flashbacks montrent comment Harrison Wells a eu l'idée de l'accélérateur de particules.",
            "date": "2015-03-31",
            "note": {
                "total": "1899",
                "mean": "4.47",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "92",
            "subtitles": []
        },
        {
            "id": 446200,
            "thetvdb_id": 5110414,
            "youtube_id": null,
            "title": "All-Star Team Up",
            "season": 1,
            "episode": 18,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E18",
            "global": 18,
            "description": "Note: Flash 1x18 takes places before Arrow 3x18.\nBarry is surprised when Felicity Smoak arrives from Starling City along with her boyfriend, Ray Palmer, who flies in as the Atom. They’ve come to visit S.T.A.R. Labs as Ray needs help with his suit. Their timing turns out to be fortuitous because it’s all hands on deck after a meta human named Brie Larvin unleashes hundreds of robotic bees to attack and kill her former co-workers, including Dr. Tina McGee. A group dinner with Barry, Felicity, Ray, Iris and Eddie turns into a disaster.",
            "date": "2015-04-14",
            "note": {
                "total": "1726",
                "mean": "4.39",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "46",
            "subtitles": []
        },
        {
            "id": 463577,
            "thetvdb_id": 5166508,
            "youtube_id": null,
            "title": "Who Is Harrison Wells?",
            "season": 1,
            "episode": 19,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E19",
            "global": 19,
            "description": "Joe et Cisco voyagent à Starling City pour continuer leur enquête sur le Dr Wells. Alors qu’ils sont en ville, le duo fait appel à l’aide du capitaine Lance, et Cisco rencontre Black Canary, qui lui demande une faveur. Pendant ce temps là, à Central City, Barry court après un meta-humain appelé Hannibal Bates, qui peut se prendre l’apparence de toutes les personnes qu’il touche - ce qui inclut Eddie, Iris, Caitlin et même The Flash.",
            "date": "2015-04-21",
            "note": {
                "total": "1737",
                "mean": "4.4940",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "51",
            "subtitles": []
        },
        {
            "id": 463578,
            "thetvdb_id": 5166509,
            "youtube_id": null,
            "title": "The Trap",
            "season": 1,
            "episode": 20,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E20",
            "global": 20,
            "description": "Barry, Caitlin, Cisco et Joe mettent en place un piège pour Wells. Cisco s'utilise lui-même en tant qu'appât, ce qui le met en grand danger. Pendant ce temps, Eddie prend une décision qui laisse Joe bien sceptique.",
            "date": "2015-04-28",
            "note": {
                "total": "1668",
                "mean": "4.6091",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "67",
            "subtitles": []
        },
        {
            "id": 463579,
            "thetvdb_id": 5166510,
            "youtube_id": null,
            "title": "Grodd Lives",
            "season": 1,
            "episode": 21,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E21",
            "global": 21,
            "description": "Barry doit s'occuper de la dernière menace du Reverse Flash qui s'en prend à un membre du groupe. Pour ne rien arranger, le Dr Wells relâche Grodd dans la ville pour distraire Barry et l'équipe. Joe, Barry et Cisco  se rendent dans les égouts pour attraper Grodd mais le gorille a rapidement le dessus sur eux, car il finit par kidnapper Joe. Puis Iris et Barry ont une discussion à cœur ouvert.",
            "date": "2015-05-05",
            "note": {
                "total": "1435",
                "mean": "4.2913",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "77",
            "subtitles": []
        },
        {
            "id": 462294,
            "thetvdb_id": 5163053,
            "youtube_id": null,
            "title": "Rogue Air",
            "season": 1,
            "episode": 22,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E22",
            "global": 22,
            "description": "As Wells once again gets the upper hand on the S.T.A.R. Labs team, Barry realizes he needs to make a big move and reaches out to an old foe, Captain Cold, for help. Joe and Caitlin warn Barry that Cold can't be trusted. True to form, Cold has his own agenda that involves the meta-humans trapped in the containment cells. As things seem to be going from bad to worse, The Flash gets reinforcements - Arrow and Firestorm.",
            "date": "2015-05-12",
            "note": {
                "total": "86",
                "mean": "4.5465",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "9",
            "subtitles": []
        },
        {
            "id": 463580,
            "thetvdb_id": 5166511,
            "youtube_id": null,
            "title": "Fast Enough",
            "season": 1,
            "episode": 23,
            "show": {
                "id": 8339,
                "thetvdb_id": 279121,
                "title": "The Flash (2014)"
            },
            "code": "S01E23",
            "global": 23,
            "description": "Wells presents Barry with a life-changing choice. Dr. Martin Stein and Ronnie Raymond return to help the S.T.A.R. Labs team with this final fight.",
            "date": "2015-05-19",
            "note": {
                "total": "2",
                "mean": "4.5",
                "user": 0
            },
            "user": {
                "seen": false,
                "downloaded": false
            },
            "comments": "0",
            "subtitles": []
        }
    ],
    "errors": []
}